""" Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N]. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X"""

# A = int(input('Введите количество элементов:'))
# a=[int(input('Введите число:')) 
# for i in range(A)]
# X=int(input('Введите заданное число:'))
# n=a.count(X)
# print(f'Всего чисел:{(n)}')


""" Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. 
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X """

# A = int(input('Введите количество элементов:'))
# a=[int(input('Введите число:')) 
# for i in range(A)]
# X=int(input('Введите заданное число:'))
# b=[abs(a[i]-X) 
# for i in range(len(a))]
# print(f'Ближайшее число:{a[b.index(min(b))]}')