""" Задача 26:  Напишите программу, которая на вход принимает два числа A и B, 
и возводит число А в целую степень B с помощью рекурсии. """

# A = int(input("Введите число A: "))
# B = int(input("Введите число B: "))
# def power(A, B):
#     if (B == 1):
#         return (A)
#     if (B != 1):
#         return (A * power(A, B - 1))
# print("A в степени B =", power(A, B))


""" Задача 28: Напишите рекурсивную функцию sum(a, b), возвращающую сумму двух целых неотрицательных чисел. 
Из всех арифметических операций допускаются только +1 и -1. Также нельзя использовать циклы. """

# a = int(input("Введите число a: "))
# b = int(input("Введите число b: "))
# def sum(a, b):
#     if b == 0:
#         return a
#     return sum(a+1, b-1)
# print("Сумма a и b =", sum(a, b))